CREATE DATABASE  IF NOT EXISTS `pairplay` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `pairplay`;
-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: k6e205.p.ssafy.io    Database: pairplay
-- ------------------------------------------------------
-- Server version	8.0.29-0ubuntu0.20.04.3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `activity`
--

DROP TABLE IF EXISTS `activity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `activity` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `created_date` datetime(6) DEFAULT NULL,
  `modified_date` datetime(6) DEFAULT NULL,
  `category_id` int NOT NULL,
  `close_dt` datetime(6) DEFAULT NULL,
  `create_id` bigint DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `meet_dt` datetime(6) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `is_end` tinyint(1) DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL,
  `mate_image` varchar(255) DEFAULT NULL,
  `age` int NOT NULL,
  `gender` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=106 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `activity`
--

LOCK TABLES `activity` WRITE;
/*!40000 ALTER TABLE `activity` DISABLE KEYS */;
INSERT INTO `activity` VALUES (44,'2022-05-19 19:02:49.118000',NULL,8,'2022-05-24 09:00:00.000000',77,'해운대 배드민턴 장에서 같이 배드민턴 칠 분 2명 더 구해요!\r 2시간 정도 칠 예정입니다!','2022-05-25 23:00:00.000000','같이 배드민턴 칠사람!',0,'부산 해운대구',NULL,20,2),(45,'2022-05-19 19:06:18.910000',NULL,9,'2022-05-26 09:00:00.000000',68,'제가 헬린이라서ㅠㅠ 운동 알려주면서 같이 운동 하실 분 구해요!\n제가 다니는 센터는 해운대 역 앞에 XX헬스장 입니다!','2022-05-27 04:00:00.000000','운동 알려줄 사람 구합니다.',0,'부산 해운대구',NULL,20,2),(46,'2022-05-19 19:12:52.310000',NULL,1,'2022-05-22 09:00:00.000000',62,'축구장 하나 빌려서 2시간 정도 뛸 예정입니다!!\n신청해주세요!','2022-05-22 18:00:00.000000','[급구]조기축구 인원 모집합니다.',0,'부산 연제구',NULL,20,0),(47,'2022-05-19 19:15:19.891000',NULL,1,'2022-05-25 09:00:00.000000',38,'인원이 3명 정도 부족하여 모집하고 있습니다.\n2시간 정도 뛸 예정입니다.\n신청바랍니다~','2022-05-27 05:00:00.000000','축구 뛰실 분 계신가요?',0,'부산 강서구',NULL,20,0),(48,'2022-05-19 19:18:42.357000',NULL,5,'2022-05-22 09:00:00.000000',70,'볼링 에버리지 200 정도 됩니다!\r 같이 ㄱㄱ','2022-05-22 22:00:00.000000','볼링치자',0,'부산 강서구',NULL,20,2),(49,'2022-05-19 19:33:34.030000',NULL,7,'2022-05-20 09:00:00.000000',62,'한 달 반 정도 배웠는데 혼자 하니까 심심하네 ㅠ\n같이 난타 연습 할 사람 구해\n','2022-05-20 23:00:00.000000','테니스 칠 사람',0,'부산 강서구',NULL,20,2),(50,'2022-05-19 20:02:53.954000',NULL,2,'2022-05-22 09:00:00.000000',9,'간만에 풋살 뛰고 싶은데 2명만 더 있음 됨','2022-05-24 04:00:00.000000','풋살 뛸 사람있어?',0,'부산 강서구',NULL,20,2),(51,'2022-05-19 20:04:24.734000',NULL,3,'2022-05-21 09:00:00.000000',38,'가볍게 뛰고 싶은데\n','2022-05-22 04:00:00.000000','길농 ㄱ?',0,'부산 강서구',NULL,20,0),(52,'2022-05-19 20:24:29.047000',NULL,1,'2022-05-25 09:00:00.000000',62,'체육공원에서 축구 뛸 2명 구함.\n','2022-05-27 04:00:00.000000','축구 2명 구함',0,'부산 강서구',NULL,20,2),(53,'2022-05-19 20:27:22.497000',NULL,5,'2022-05-20 09:00:00.000000',68,'잘 몰라서 배우면서 치고 싶습니다!\n3분 더 모을 계획입니다!','2022-05-21 23:00:00.000000','볼링 치고 싶어요~',0,'부산 강서구',NULL,0,2),(54,'2022-05-19 20:31:31.544000',NULL,8,'2022-05-21 09:00:00.000000',77,'나랑 내 친구랑 같이 복식으로 뛸 2명 구해!ㅎㅎ 신청해주라!','2022-05-22 23:00:00.000000','배드민턴 치고 싶어ㅜㅜ',0,'부산 강서구',NULL,20,1),(55,'2022-05-19 20:37:19.852000',NULL,6,'2022-05-21 09:00:00.000000',78,'골프 함께해요\n100타 밖에 못 치는 초보 입니다..','2022-05-23 00:00:00.000000','골프 인원 구함',0,'부산 강서구',NULL,30,0),(56,'2022-05-19 20:54:08.428000',NULL,1,'2022-05-21 09:00:00.000000',62,'일요일 오전임! 한명 급구','2022-05-22 17:00:00.000000','[급구]1명!!',0,'부산 해운대구',NULL,20,2),(57,'2022-05-19 20:54:21.603000',NULL,2,'2022-05-06 09:00:00.000000',62,'5월 5일에 저녁 9시 밥 먹고 늦은 시간이지만 마 풋살 함 해보입시다.','2022-05-06 06:00:00.000000','마 함 해보입시다.',1,'부산 중구',NULL,20,0),(58,'2022-05-19 21:18:49.526000',NULL,1,'2022-05-22 09:00:00.000000',79,'매주 일요일 오전에 조기 축구 할 사람 모읍니다.\n기존 동호회 17명 정도 있고 추가로 모집 하고 싶습니다.\n','2022-05-23 17:00:00.000000','매주 일요일 같이 뛸 사람구해요',0,'부산 강서구',NULL,20,0),(59,'2022-05-19 21:56:33.436000',NULL,1,'2022-05-05 09:00:00.000000',81,'축구 재밌게 하실분 구해요','2022-05-19 23:00:00.000000','같이 축구하실분',1,'전북 전주시',NULL,20,2),(60,'2022-05-19 21:57:57.787000',NULL,1,'2022-05-17 09:00:00.000000',81,'재밌게 축구해요','2022-05-18 21:00:00.000000','축구하실분',0,'부산 강서구',NULL,10,2),(61,'2022-05-19 22:27:06.186000',NULL,5,'2022-05-21 09:00:00.000000',38,'볼링칩시다!','2022-05-22 02:00:00.000000','볼링 ㄱ?',0,'부산 강서구',NULL,20,2),(62,'2022-05-19 22:33:12.520000',NULL,1,'2022-04-13 09:00:00.000000',38,'날씨좋은데 축구 찰 사람 급구급구','2022-04-14 22:00:00.000000','축구찹시다',1,'부산 중구',NULL,20,0),(63,'2022-05-19 22:35:10.964000',NULL,5,'2022-05-14 09:00:00.000000',38,'볼링 치고 싶은데\n같이 칠 사람 있나?\n인원은 4명 정도 생각 중','2022-05-15 23:00:00.000000','볼링 치고 싶음',1,'부산 금정구',NULL,20,2),(64,'2022-05-19 22:56:30.251000',NULL,11,'2022-04-30 09:00:00.000000',38,'격투기 연습 좀 하고싶습니다.','2022-05-02 00:00:00.000000','스파링 함 뜨까',1,'부산 부산진구',NULL,20,0),(65,'2022-05-19 23:25:49.315000',NULL,2,'2022-05-14 09:00:00.000000',38,'가볍게 1시간 정도 뛰고 싶은데 사람 구한다. ','2022-05-15 23:00:00.000000','풋살 뛸 사람 구해',1,'부산 강서구',NULL,20,0),(66,'2022-05-20 02:07:41.966000',NULL,8,'2022-05-14 09:00:00.000000',38,'연령무관 상관없음 다같이합시다','2022-05-16 06:00:00.000000','배드민턴 치실분',0,'부산 중구',NULL,0,2),(67,'2022-05-20 02:37:28.592000',NULL,1,'2022-05-11 09:00:00.000000',38,'축구할사람구해여','2022-05-12 17:00:00.000000','축구 ㄱ',0,'부산 동래구',NULL,0,0),(68,'2022-05-20 02:38:03.159000',NULL,2,'2022-05-09 09:00:00.000000',38,'풋살 뛰고 치맥 ㄱ?','2022-05-11 04:00:00.000000','가볍게 풋살뛰실?',0,'부산 동구',NULL,20,0),(69,'2022-05-20 02:38:58.163000',NULL,3,'2022-05-01 09:00:00.000000',38,'농구 할 사람 구합니다','2022-05-02 19:00:00.000000','농구 할사람!',0,'부산 동래구',NULL,20,0),(70,'2022-05-20 02:39:47.564000',NULL,5,'2022-05-02 09:00:00.000000',38,'볼링 같이 칠 친구 구합니다.\n실력 상관 없음','2022-05-04 00:00:00.000000','볼링 칩시다',0,'부산 사하구',NULL,0,2),(71,'2022-05-20 02:40:15.904000',NULL,9,'2022-04-30 09:00:00.000000',38,'헬스 운동 알려주면서 같이 할 사람 구함','2022-05-01 21:00:00.000000','운동 알려줄 사람',0,'부산 북구',NULL,20,0),(72,'2022-05-20 06:03:01.010000',NULL,12,'2022-05-28 09:00:00.000000',82,'저 수영 선수 출신이라서 아주 잘 가르쳐드릴 수 있습니다!','2022-05-30 21:00:00.000000','5월 30일날 수영하러 가실 분 구합니다!',0,'부산 강서구',NULL,30,0),(73,'2022-05-20 10:24:23.766000',NULL,8,'2022-05-29 09:00:00.000000',9,'5/30일 같이 배드민턴 하실분 구합니다','2022-05-30 23:00:00.000000','같이 배드민턴 하실분',0,'부산 강서구',NULL,20,2),(74,'2022-05-20 10:34:52.099000',NULL,9,'2022-05-23 09:00:00.000000',83,'운동하자 \n헬스 알려줄게❤ \n','2022-05-25 05:00:00.000000','운동합시다',0,'부산 강서구',NULL,30,0),(75,'2022-05-20 10:38:08.856000',NULL,2,'2022-05-26 09:00:00.000000',81,'풋살 뛸 사람 구합니다. 3명 더 필요함','2022-05-28 01:00:00.000000','풋살 함께 합시다',0,'부산 강서구',NULL,0,0),(76,'2022-05-20 10:54:06.995000',NULL,8,'2022-05-27 09:00:00.000000',82,'한명만 더 있으면 됩니다! ','2022-05-28 22:00:00.000000','배드민턴 같이 칠 사람!',0,'부산 강서구',NULL,0,0),(77,'2022-05-20 11:05:22.793000',NULL,8,'2022-05-29 09:00:00.000000',88,'매주 일요일 배드민턴 같이 하실 분 구합니다!\n\n빠르면 이번 주에 바로 시작해도 좋아요!\n\n연락 주세요!','2022-05-22 19:00:00.000000','매주 일요일 배드민턴 같이 하실 분 구합니다!',0,'부산 해운대구',NULL,30,2),(78,'2022-05-20 11:11:35.397000',NULL,4,'2022-06-12 09:00:00.000000',89,'야구 선수 준비하고 있는 중학생 입니다!\n잘 할 수록 좋아요!\n연락 부탁드려요!','2022-05-28 23:00:00.000000','매주 토요일 야구 배팅 연습하실 분 구합니다!',0,'부산 수영구',NULL,10,2),(79,'2022-05-20 10:54:06.995000',NULL,1,'2022-04-17 00:00:00.000000',38,'모닝축구! 같이 운동합시다 2명 급구합니다!!','2022-04-17 09:00:00.000000','[급구]조기축구ㄱ',1,'부산 강서구',NULL,0,0),(80,'2022-05-20 10:54:06.995000',NULL,8,'2022-04-17 00:00:00.000000',38,'같이 치자 배드민턴! 재밌겟다!','2022-04-17 13:00:00.000000','배드민턴 치러 갑시다',1,'부산 강서구',NULL,0,0),(81,'2022-05-20 10:54:06.995000',NULL,11,'2022-04-18 00:00:00.000000',38,'복싱 입문했다. 알려줄 사람 구한다','2022-04-18 17:00:00.000000','복싱 알려줄사람',1,'부산 강서구',NULL,0,0),(82,'2022-05-20 10:54:06.995000',NULL,8,'2022-04-18 00:00:00.000000',38,'나랑 같이 배드민턴 쳐주라 복식도 괜찮고 단일 경기도 괜찮음','2022-04-18 19:00:00.000000','배드민턴 칩시다',1,'부산 강서구',NULL,0,0),(83,'2022-05-20 10:54:06.995000',NULL,7,'2022-04-18 00:00:00.000000',38,'테니스 배우고 싶은 사람 연락해줘 알려줄수있어','2022-04-18 22:00:00.000000','테니스 배우고 싶은 사람?',1,'부산 강서구',NULL,0,0),(84,'2022-05-20 10:54:06.995000',NULL,8,'2022-04-19 00:00:00.000000',38,'배드민턴 저번에 같이 친 사람도 좋고 다 신청해줘','2022-04-19 09:00:00.000000','배드민턴 치러 갑시다',1,'부산 강서구',NULL,0,0),(85,'2022-05-20 10:54:06.995000',NULL,11,'2022-04-20 00:00:00.000000',38,'초보야 같이 하면서 알려줄 사람 구해','2022-04-20 10:00:00.000000','복싱 함 봐줘',1,'부산 강서구',NULL,0,0),(86,'2022-05-20 10:54:06.995000',NULL,7,'2022-04-21 00:00:00.000000',38,'테니스 알려주면서 같이 치고 끝나고 치맥할사람?','2022-04-21 14:00:00.000000','테니스ㄱ',1,'부산 강서구',NULL,0,0),(87,'2022-05-20 10:54:06.995000',NULL,8,'2022-04-24 00:00:00.000000',38,'같이 치자 배드민턴! 재밌겟다!','2022-04-24 14:00:00.000000','배드민턴 치러 갑시다',1,'부산 강서구',NULL,0,0),(88,'2022-05-20 10:54:06.995000',NULL,11,'2022-04-25 00:00:00.000000',38,'격투기를 마스터 할 생각임. 경기 떠줄사람 구함','2022-04-25 09:00:00.000000','격투기 대전 상대 구함',1,'부산 강서구',NULL,0,0),(89,'2022-05-20 10:54:06.995000',NULL,11,'2022-04-25 00:00:00.000000',38,'나는지치지 않는다. 자세 봐줄 사람 구함','2022-04-25 10:00:00.000000','격투기 알려 줄 사람!',1,'부산 강서구',NULL,0,0),(90,'2022-05-20 10:54:06.995000',NULL,11,'2022-04-25 00:00:00.000000',38,'다양한 체급 체험해 보고 싶은데 연락 줘','2022-04-25 14:00:00.000000','격투기 대전 함 뜨',1,'부산 강서구',NULL,0,0),(91,'2022-05-20 10:54:06.995000',NULL,6,'2022-04-26 00:00:00.000000',38,'골프 이제 입문하는데 누가 좀 알려주면 좋겠네. 골프 잘 치는 사람 좀 봐주라','2022-04-26 08:00:00.000000','골린이 살려줘',1,'부산 강서구',NULL,0,0),(92,'2022-05-20 10:54:06.995000',NULL,6,'2022-04-26 00:00:00.000000',38,'골프 이제 입문하는데 누가 좀 알려주면 좋겠네. 골프 잘 치는 사람 좀 봐주라','2022-04-26 10:00:00.000000','골린이 살려줘222',1,'부산 강서구',NULL,0,0),(93,'2022-05-20 10:54:06.995000',NULL,6,'2022-04-26 00:00:00.000000',38,'골프 이제 입문하는데 누가 좀 알려주면 좋겠네. 골프 잘 치는 사람 좀 봐주라','2022-04-26 14:00:00.000000','골린이 살려줘333',1,'부산 강서구',NULL,0,0),(94,'2022-05-20 10:54:06.995000',NULL,6,'2022-04-26 00:00:00.000000',38,'골프 이제 입문하는데 누가 좀 알려주면 좋겠네. 골프 잘 치는 사람 좀 봐주라','2022-04-26 16:00:00.000000','골린이 살려줘444',1,'부산 강서구',NULL,0,0),(95,'2022-05-20 10:54:06.995000',NULL,8,'2022-04-27 00:00:00.000000',38,'가볍게 볼링 칠 사람. 3명 필요함!','2022-04-27 13:00:00.000000','볼링 ㄱ',1,'부산 강서구',NULL,0,0),(96,'2022-05-20 10:54:06.995000',NULL,8,'2022-05-01 00:00:00.000000',38,'몇일 전에 볼링 쳤는데 또 치고싶다. 같이 갈 사람?','2022-05-01 20:00:00.000000','볼링 ㄱ',1,'부산 강서구',NULL,0,0),(97,'2022-05-20 11:21:21.490000',NULL,11,'2022-06-12 09:00:00.000000',88,'무술을 배우셨고 격투기를 조금 잘하신다 하시는 분 모집합니다.','2022-05-29 20:00:00.000000','격투기 좀 배우신 분 스파링 상대 모집합니다!',0,'부산 중구',NULL,20,0),(98,'2022-05-20 11:22:19.853000',NULL,1,'2022-05-02 09:00:00.000000',38,'우리 팀이랑 축구 뛸 팀 구한다..\n덤벼','2022-05-02 21:00:00.000000','축구 경기 뛸 팀 구해',1,'부산 강서구',NULL,0,2),(99,'2022-05-20 11:22:57.993000',NULL,7,'2022-05-02 09:00:00.000000',38,'테니스 같이 칩시다 알려줄게요~','2022-05-03 05:00:00.000000','테니스 같이 치실 분?',1,'부산 강서구',NULL,0,0),(100,'2022-05-20 11:24:13.529000',NULL,12,'2022-05-05 09:00:00.000000',38,'나 수영 좀 알려줘, 나 숨쉬기 밖에 못해','2022-05-05 17:00:00.000000','수영 배우러 다니는 사람?',1,'부산 강서구',NULL,0,2),(101,'2022-05-20 11:24:46.112000',NULL,10,'2022-05-06 09:00:00.000000',38,'필라테스 처음 해보려고 하는 데 혹시 알려줄 사람 있어?\n밥 삼','2022-05-06 18:00:00.000000','필라테스 도전',1,'부산 강서구',NULL,0,2),(102,'2022-05-20 11:25:20.232000',NULL,11,'2022-05-28 09:00:00.000000',90,'금정구 격투기 동호 회원 모집합니다!','2022-05-29 19:00:00.000000','금정구 격투기 동호 회원 모집합니다!',0,'부산 금정구',NULL,20,0),(103,'2022-05-20 11:26:04.333000',NULL,11,'2022-04-30 09:00:00.000000',38,'아이캔두디스올데이','2022-04-30 20:00:00.000000','스파링 뜨실 분?',1,'부산 강서구',NULL,20,0),(104,'2022-05-20 11:28:06.812000',NULL,11,'2022-05-30 09:00:00.000000',38,'가자 내랑 스파링 함 뜨 나 슈퍼미들급임','2022-04-30 20:00:00.000000','스파링 함 뜨',1,'부산 강서구',NULL,0,0),(105,'2022-05-20 11:33:51.173000',NULL,9,'2022-05-30 09:00:00.000000',78,'형 어깨하는 날인데 같이 운동하자 형만 믿고 따라와','2022-05-30 18:00:00.000000','형이랑 운동하자',0,'부산 강서구',NULL,20,0);
/*!40000 ALTER TABLE `activity` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-05-20 11:41:24
